{
  "1": [
    {
      "title": "United Nations   SECURITY COUNCIL",
      "content": "LETTER DATED 22 JULY 1949 FROM THE DIRECTOR-GENERAL FOREIGN AFFAIRS, KATHMANDU, NEPAL TO THE CHAIRMAN .OF THE COMMITTEE ON THE ADMISSION OF NEW MEMBERS<br><br>Kathmandu,22 July 1949<br><br>I have the honour to inform you that Major Padma Bahadl~ Khatri,<br>the representative of the Kingdom of Nepal in New York, has forwarded to me your letter dated 26 May 1949, containing the text of the resolution adopted at the 32nd meeting of the Committee on the Admission of New Members, together with the Working Paper prepared by the Secretariat and the summary records of the 31st and 32nd meetings of the Committee at which the application of Nepal was discussed.<br><br>I have the honour to enclose herewith a Note prepared by us which sets forth further information and certain corrections proposed to be incorporated into the Working Paper, and also the additional information concerning Nepal, particularly concerning its sovereignty and independence. It is hoped this will satisfy the Committee and enable it to forward the application of Nepal to the Security Council with its recommendation for acceptance."
    },

    {
      "title":"REPLY TO INQUIRY 0F UNITED NATIONS COMMITTEE ON THE ADMISSION OF NEW MEMBERS" ,
      "content": "The Government of Nepal forwards this reply to the letter of the Chairman of the Committee of 26 May 1949. In that letter the Government of Nepal was informed of the resolution adopted by the Committee on 24 May 1949 requesting additional information concerning Nepal and particularly concerning its sovereignty and independence.<br><br>The Government of Nepal appreciates that this resolution was framed as a request for information rather than in a form that might cast doubt upon Nepal's sovereignty and independence. The Government of Nepal welcomes the opportunity to set forth all relevant facts concerning its governmental status.<br><br>These facts are contained in Annex I to this letter, which also includes the texts of relevant treaties entered into by Nepal that are not already before the Committee.<br><br>The Government of Nepal congratulates the Secretariat on the excellent abstract prepared on Nepal, which gives a fair general picture of the country and its institutions. Annex II contains amendments and additions for greater completeness and accuracy.<br><br>No question has been raised regarding the peace-loving character of Nepal nor regarding her ability or willingness to fulfil the obligations of the Charter. The record of Nepal before and during both World Wars establishes the value of her contribution to international peace.<br><br>The Government of Nepal trusts that this material, which may be supplemented by the Nepalese representative before the Committee, will enable the Committee to make a favourable recommendation regarding Nepal's admission to membership."
    },

    {
      "title":" Information supplied by the Govermnent of Nepal regarding the sovereignty and Independence of the Kingdom of Nepal" ,
      "content": "1. Nepal has for centuries been an independent sovereign State. It has never been conquered; no foreign power has occupied the country or intervened in its internal or external affairs. No foreign flag has ever flown over Nepal.<br><br>Nepal has its own Sovereign and its own system of government. It is responsible for its own foreign relations, and no external power has exercised control over it. Nepal has declared war and concluded peace (with Britain in 1815, China in 1792, Tibet in 1855) without reference to any third party.<br><br>Nepal applied for membership of the United Nations entirely on its own initiative, without reference to any foreign State.<br><br>2. The present governmental status of Nepal must be considered for admission to membership. Nepal has never surrendered its sovereignty or independence through any treaty.<br><br>The Treaty of 1792 with China and the Treaty of Sugauli (1815) were concluded after defeat in war, but many states have lost territory without forfeiting their sovereignty. To remove any doubt, Nepal later entered into the Treaty of 1923 with Britain, which restated Nepal's independence and sovereignty.<br><br>3. The Treaty of 21 Decembor 1923<br> 'The text of this Treaty is attached, (Annex I) to the Secretariat Working Paper No. 15 of 4 April 1949. The Goverrnnent of Nepal wishes tomake the following observations upon certain of its provisions:<br>(a) By Article I the Governments of Great Britain and Nepal agree mutally to acknowledgeand respect each other's independence both internal and external. This article restates and reaffims an"

    }

    {
  "title": ,
  "content": "The existing situation does not confer, nor does it claim to confer, independence on Nepal for the first time. However, it is an explicit statement which removes \"the rest of the threat.\"<br><br>(b) Article II confirms the Treaty of Segowlie of 1815 and other treaties, agreements, and engagements except where they may be inconsistent with the present Treaty. The Government of Nepal has never considered that either the Treaty of Segowlie or any other agreements impaired its independence or sovereignty. Even if any provisions had such an effect, they would be cancelled by the explicit statement in Article I, which reaffirmed the independence of both states.<br><br>(c) Article V deals with the import of arms, ammunition, and warlike stores. The purpose of this article was to regulate, in an orderly and peaceful manner, the import of arms through British Indian territory and ports. It is a misunderstanding to suppose that this article made Nepal dependent on the United Kingdom for arms and equipment. Neither Article V nor Article VI interfered with Nepal’s right to import arms or equipment from China, Russia, or any other country through its northern borders.<br><br>Although certain restrictions were imposed on imports through British India, these restrictions were for the security of India, not to limit Nepal’s independence. In fact, Nepal manufactures its own weapons, equipment, and ammunition in its own arsenals. The Nepalese Army is a national army, fully officered by Nepalese nationals. It is incorrect to suppose that the Nepalese Army depends on foreign supplies. Furthermore, since the British withdrawal from India, no question can arise of British control under this article.<br><br>(d) Article VI was a commercial concession to Nepal regarding goods imported through British India. The Government of Nepal points out that the British Government agreed to accept as conclusive a certificate issued by the Nepalese Government stating that the goods were the property of the Government of Nepal and were required for public service. This procedure is consistent with the complete and equal sovereignty of the Nepalese Government."
},

{
  "title": ,
  "content": "Re Afghan Treaty.  With regard to both Article V and Article VI of this Treaty, the Government of Nepal has observed that similar provisions appear in the Treaty signed on 22 November 1921 between the Governments of the United Kingdom and Afghanistan—two indisputably sovereign states admitted to the United Nations. The relevant portions of Articles VI and VII of that Treaty are attached. The presence of such provisions in the Treaty of 21 December 1923 between the Governments of the United Kingdom and Nepal therefore cannot be taken to reflect any inferiority in Nepal’s status; on the contrary, they highlight Nepal’s full independence and sovereignty.<br><br>11. The Treaty of 2 December 1815 (Segauli Treaty)<br><br>The text of this Treaty is attached for the information of the Committee.<br><br>(a) The preamble shows that the Treaty was entered into following a war between the East India Company and the Rajah of Nepal. The power to make war is an attribute of sovereignty, and the Rajah of Nepal, in entering the conflict, was acting as a sovereign ruler. The preamble states that the parties were mutually disposed to restore the relations of peace and amity that had existed before the dispute. This demonstrates that nothing in the Treaty was intended to compromise the independence of the Rajah. As to the general effect and intention of the Treaty, reference may be made to a source listed by the Secretariat: Perceval Landon, *Nepal* (London: Constable, 1928), p. 101, which states:<br><br>\"At the Treaty of Sagauli in 1816 there was no pretence whatever that the agreement then made was other than a contract between two independent parties.\"<br><br>(b) Article III.<br><br>Under this article, certain territories were ceded by the Rajah. The Government of Nepal notes the following regarding these cessions:<br><br>(i) Cession of territory under a peace treaty has never implied or resulted in a loss of sovereignty or independence except with respect to the ceded areas themselves. If the contrary were true, very few states today could be regarded as sovereign and independent."
}

{
  "title": ,
  "content": "(ii) That the cession of a portion of these territories—namely, the greater part of those secondly and thirdly mentioned in the article—was renounced by the British Government on 8 December 1816 (see the letter of that date attached, together with the reply of the Government of Nepal dated 11 December 1816).<br><br>(iii) That a further part of the territories—namely, the greater part of those firstly mentioned in the article—was ceded by the British Government to the Government of Nepal by treaty on 1 November 1860. The terms of this Treaty (the text of which is attached) show that it was concluded between two fully sovereign states. The Government of Nepal particularly refers to Article II, by which the territory is expressed to be bestowed upon the Maharajah of Nepal \"in full sovereignty.\" If the Maharajah of Nepal was recognized as fully sovereign over these territories—territories formerly ceded by him—there can be no doubt regarding his full and unimpaired sovereignty over the territory (forming by far the greater part of Nepal) in which he had never been disturbed.<br><br>(iv) That, with regard to the territories ceded by Article III, the British Government (by Article IV) agreed to pay a substantial sum as pensions to dispossessed chiefs of Nepal.<br><br>(c) Article VI. This article provides for arbitration by the British Government in the event of a dispute arising between the State of Nepal and the neighboring State of Sikkim. The Government of Nepal supposes that the absence of the complete text may have led some members of the Committee to assume that this article provided for the settlement of disputes between Nepal and the British Government—which is not, and never has been, the case. Disputes between the latter two governments have always been resolved diplomatically in the usual manner.<br><br>This article has, in fact, never been invoked due to the peaceful relations between Nepal and Sikkim, and it must now be considered obsolete through long disuse.<br><br>(d) Article VII. This article was evidently inserted against foreign adventurers disturbing the peace in India and its frontiers, rather than against Nepal’s right to grant asylum. Instances of asylum granted can be cited as far back as the mid-19th century—for example, Nana Saheb and his family, the Queen of Lahore, and the Princes of Oudh, etc. Even under the terms of the article,"
}

  ]
}

