[
  { "title": "Page 1", "content": "LETTER DATED 22 JULy 1949 FROM THE 'DIRJ[}'I'OR-G .1.0~(-1[C:J,( C , ~~619
FOREIGN AFFAIRS, KATHW\.HDU, N'EPAL TO THE CHA.IF.MAN . -----~ J
OF THE COMMITTJi,"'E ON THE ADMISSION
OF NE\f MJ!l.fBERS
. Kathmandu, 22 July 1949
I have the honour to inform you that Major Padma Bahadl~ Khatri,
the representative of ihe Kingdmn of Nopal in New York, has forvrorded
to me your letter to him dated 26 May 1949, containing the text of the
resolution adopted at the 32nd meeting of the Committee on the Admission of
NelT Members, together with the copy of the Horking Paper prepared by the
Secretariat for the reference of the Committee, and the summary records
of the 31st anct 32nd meetings of the Committee at which the applj.cation
of Nepal was discussed.
I have the honour to enclose herewith a Note prepared by us which
sets forth coma further information and certain emendations proposed to
be incorporated into the Working Paperj and also the additional
infol~tion concerning Nepal and particularly concerning its_
sovereignty and independenco, which, it is hoped, will satisfy the
Committee, and will enable it to fOl~ard the application of Nepal
to the Securit~ Council together with the Committeels recommendation
for its acceptance by tho Council.
(Signod) Bijaya Shamshcr
(Major-General Bijaya Shamsher)
Dircetor-General, Foreign Affairs, KSr thm~~ndu." },



  { "RET'LY TO INQUIRY 0]' mJITED NATIONS OO!'lMIT'llEE
ON THE miISSION OF NEW MEMBERS": "Page 2", "content": "The Govern,'nent of rJepal fonrarr:.s this reply to the letter of the
Cha:i:cill'3.Il of the Committee of 26 ~1ay 1949. In -that, letter the Govel'nnlent
of Nepal was informed of the resol~tion adopted by the Committee on
24 Hay 1949 :ceg,uestlng additlo~1al 5.nfo:r-mation concerning Nepal end
pm.~ticule..rly concel'ning its sovereigl1ty and its independence. Th3
Gov8rmn.ent of Nepal expresses its appreciation of the fact that this
resolu.tion "ras passed in the form of a request for information rather than
in a form which might appear to cast doubts upon its sovereignty and
independence. The Goyernment of Nepal welcomes the opportunity to set
forth all the facts in relat~on to its governrr~ntal status whicll it io
hoped 'nIl satisfy the Cornmittee. These facts are contained in Annex I
to this letter ~Thich also contains the texts of the l~eleval1t treaties
entered. into by Nepal which are not already before the Committe~.
'rhe Gove:r'nment of .Nepal wishes to cong:;.....atulate the Secretariat on
the excellent abstract it has prepaTed on Wepal v7hleh 8ives in general
outline a fair picture of the Country and its institutions. The GoverI"..:1lent
of Ne~al attaches as Annex 11 to this letter some amendments and additions
which in the interest of greater complet~on and accuracy should be
made to this abstract.
The Government of Nepal notes with satisfaction that in the discussions
of the Committee no question was raised regarding the peace-loving
character of the State nor regarding her ability or vr.tllingness to
fuli'il the obligations of the Charter. The record ef Nepal both before
and. during the tw'o ,.orld ,mrs in fact m013t clearly establishes the value
of the contribution v1h1ch Nepal has InaQ.e to the cause of int,ernational
peace.
The Government of Nepal trusts that on the basis of this material,
'\lhich can if reg,uired be supplemented by the Nepalese repre8entative
before the Committee, the Committee will be able to make a favourc.ble
recommendation regarding Nepal's admission to membership." },
  { "title": "Page 3", "content": "Your text for page 3 here." }
]