{
  "1": [
    {
      "title": "Page 1",
      "content": "I have the honour to inform you that Major Padma Bahadl~ Khatri,<br>the representative of the Kingdom of Nepal in New York, has forwarded to me your letter dated 26 May 1949, containing the text of the resolution adopted at the 32nd meeting of the Committee on the Admission of New Members, together with the Working Paper prepared by the Secretariat and the summary records of the 31st and 32nd meetings of the Committee at which the application of Nepal was discussed.<br><br>I have the honour to enclose herewith a Note prepared by us which sets forth further information and certain corrections proposed to be incorporated into the Working Paper, and also the additional information concerning Nepal, particularly concerning its sovereignty and independence. It is hoped this will satisfy the Committee and enable it to forward the application of Nepal to the Security Council with its recommendation for acceptance."
    },

    {
      "title": "Page 2",
      "content": "The Government of Nepal forwards this reply to the letter of the Chairman of the Committee of 26 May 1949. In that letter the Government of Nepal was informed of the resolution adopted by the Committee on 24 May 1949 requesting additional information concerning Nepal and particularly concerning its sovereignty and independence.<br><br>The Government of Nepal appreciates that this resolution was framed as a request for information rather than in a form that might cast doubt upon Nepal's sovereignty and independence. The Government of Nepal welcomes the opportunity to set forth all relevant facts concerning its governmental status.<br><br>These facts are contained in Annex I to this letter, which also includes the texts of relevant treaties entered into by Nepal that are not already before the Committee.<br><br>The Government of Nepal congratulates the Secretariat on the excellent abstract prepared on Nepal, which gives a fair general picture of the country and its institutions. Annex II contains amendments and additions for greater completeness and accuracy.<br><br>No question has been raised regarding the peace-loving character of Nepal nor regarding her ability or willingness to fulfil the obligations of the Charter. The record of Nepal before and during both World Wars establishes the value of her contribution to international peace.<br><br>The Government of Nepal trusts that this material, which may be supplemented by the Nepalese representative before the Committee, will enable the Committee to make a favourable recommendation regarding Nepal's admission to membership."
    },

    {
      "title": "Page 3",
      "content": "1. Nepal has for centuries been an independent sovereign State. It has never been conquered; no foreign power has occupied the country or intervened in its internal or external affairs. No foreign flag has ever flown over Nepal.<br><br>Nepal has its own Sovereign and its own system of government. It is responsible for its own foreign relations, and no external power has exercised control over it. Nepal has declared war and concluded peace (with Britain in 1815, China in 1792, Tibet in 1855) without reference to any third party.<br><br>Nepal applied for membership of the United Nations entirely on its own initiative, without reference to any foreign State.<br><br>2. The present governmental status of Nepal must be considered for admission to membership. Nepal has never surrendered its sovereignty or independence through any treaty.<br><br>The Treaty of 1792 with China and the Treaty of Sugauli (1815) were concluded after defeat in war, but many states have lost territory without forfeiting their sovereignty. To remove any doubt, Nepal later entered into the Treaty of 1923 with Britain, which restated Nepal's independence and sovereignty.<br><br>3. The Treaty of 21 December 1923 (attached as Annex I) confirmed mutual recognition of independence by both Governments and reaffirmed Nepal's sovereign status."
    }
  ]
}
